Revit 2027 API
IExternalServer.GetServerId Method
 Implement this method to return the id of the server.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Guid GetServerId()
Function GetServerId As Guid
Guid GetServerId()
abstract GetServerId : unit -> Guid
Return Value
Guid
 The id of the server.
Remarks
 The Id must uniquely identify the external server to the corresponding external service. It will be an error when two servers with identical Ids try to register for one external service.
See Also
Reference
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace